package io.simpolor.quiz.codeup;

public class Q1006 {

    /***
     * ----------------------------
     * 문제 설명
     * ----------------------------
     * 이번에는 여러 가지 특수문자를 모두 출력해야 한다.
     *
     * 다음과 같은 "문장"을 출력하시오.
     *
     * "!@#$%^&*()"
     *
     * (주의 : 특수 문자를 출력하기 위한 방법들이 약간씩 다르니 주의하도록 한다.)
     *
     * ----------------------------
     * 입력
     * ----------------------------
     * 없음
     *
     * ----------------------------
     * 출력
     * ----------------------------
     * "!@#$%^&*()"
     *
     */
    public static void main(String[] args){
        System.out.println("\"!@#$%^&*()\"");
    }
}
