package io.simpolor.quiz.codeup.basic101;

public class Q1007 {

    /***
     * ----------------------------
     * 문제 설명
     * ----------------------------
     * 이번에는 여러 가지 문자들이 포함된 문장을 출력해보자.
     *
     * 다음과 같은 파일 경로를 그대로 출력하시오.
     *
     * "C:\Download\hello.cpp"
     *
     * (주의 : 백 슬래시문자(\) 도 출력되어야 한다. 백 슬래시 문자는 글꼴에 따라 '￦' 로 출력되기도 하지만, 같은 문자이다.)
     *
     * ----------------------------
     * 입력
     * ----------------------------
     * 없음
     *
     * ----------------------------
     * 출력
     * ----------------------------
     * "C:\Download\hello.cpp"
     *
     */
    public static void main(String[] args){
        System.out.println("\"C:\\Download\\hello.cpp\"");
    }
}
