package io.simpolor.quiz.codeup.basic101;

public class Q1003 {

    /***
     * ----------------------------
     * 문제 설명
     * ----------------------------
     * 이번에는 줄을 바꿔 문장을 출력하는 출력을 연습해보자.
     * 다음과 같이 줄을 바꿔 출력 해야한다.
     *
     * Hello
     * World
     *
     * 두 줄에 걸쳐서 줄을 바꿔 출력
     *
     * ----------------------------
     * 입력
     * ----------------------------
     * 없음
     *
     * ----------------------------
     * 출력
     * ----------------------------
     * Hello
     * World
     *
     */
    public static void main(String[] args){
        System.out.println("Hello\nWorld");
    }
}
