package io.simpolor.quiz.doit.chapter07;

/**
 * 집합
 * - 명확한 조건을 만족하는 자료의 모집
 * - 집합도 자료구조로 표현할 수 있음
 *
 * 집합과 요소
 * - 집합(set) 객관적으로 범위를 규정한 '어떤 것'의 모임이다.
 * - 집합 안에서 각각 '어떤 것'을 요소(element)라고 부른다.
 * - 집합에는 순서가 없습니다.
 * - 예제로 트와이스라는 집합에 모모, 사나, 미나, 채영 등을 집합의 요소라고 할 수 있다.
 * - 집합의 요소는 모두 달라야한다.
 *
 * 부분집합과 진부분집합
 * - 부분집합은 집합 A의 모든 요소가 집합 B의 요소에 포함되면 A는 B의 부분집합이다. ( 동일해도 됨 )
 * - 부분집합은 집합 A의 모든 요소가 집합 B의 요소에 포함되면 A는 B의 부분집합이다. ( 동일하면 안됨 )
 *
 * 그 외의 집합
 * - 합집합
 * - 교집합
 * - 차집합
 *
 * 같은 자료형이 모인 집합은 배열로 표현할 수 있습니다.
 *
 * String.indexOf 메서드로 문자열 검색하기
 * - java.lang.String 클새르는 문자열을 검색하는 indexOf 메서드와 lastIndexOf 메서드를 제공합니다.
 */